; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v4 - type_3 ?v3 - type_1)
 	      (pred_4 ?v8 - object ?v3 - type_1)
	      (pred_2 ?v4 - type_3 ?v5 - type_2)
	      (pred_3 ?v4 - type_3 ?v8 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v4 - type_3 ?v1 ?v6 - type_1)
       :precondition (and  (pred_1 ?v4 ?v1))
       :effect (and  (pred_1 ?v4 ?v6)
		     (not (pred_1 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_3 ?v2 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v7) (pred_1 ?v4 ?v7) (pred_2 ?v4 ?v5))
       :effect (and (pred_3 ?v4 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v7)) 
		    (not (pred_2 ?v4 ?v5))))

   (:action op_3
       :parameters (?v4 - type_3 ?v2 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v2 ?v5) (pred_1 ?v4 ?v7))
       :effect (and (pred_4 ?v2 ?v7)
		    (pred_2 ?v4 ?v5)
		    (not (pred_3 ?v4 ?v2 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_3
obj_02 obj_05 - type_2
obj_10 obj_07 obj_06 obj_09 - type_1
obj_08 obj_04 obj_03 - object)
(:init
(pred_1 obj_01 obj_07)
(pred_2 obj_01 obj_02)
(pred_2 obj_01 obj_05)
(pred_4 obj_08 obj_09)
(pred_4 obj_04 obj_07)
(pred_4 obj_03 obj_06)
)
(:goal
(and
(pred_4 obj_08 obj_07)
(pred_4 obj_04 obj_07)
(pred_4 obj_03 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_01 ?b obj_05))))
)
)

; plan
1. (op_2 obj_01 obj_07 obj_06)
   deleted: (pred_1 obj_01 obj_07)
   added: (pred_1 obj_01 obj_06)
   goals met: 1 of 3
2. (op_1 obj_01 obj_03 obj_06 obj_02)
   deleted: (pred_4 obj_03 obj_06) (pred_2 obj_01 obj_02)
   added: (pred_3 obj_01 obj_03 obj_02)
   goals met: 1 of 3
3. (op_2 obj_01 obj_06 obj_09)
   deleted: (pred_1 obj_01 obj_06)
   added: (pred_1 obj_01 obj_09)
   goals met: 1 of 3
4. (op_3 obj_01 obj_03 obj_09 obj_02)
   deleted: (pred_3 obj_01 obj_03 obj_02)
   added: (pred_4 obj_03 obj_09) (pred_2 obj_01 obj_02)
   goals met: 2 of 3
5. (op_1 obj_01 obj_08 obj_09 obj_02)
   deleted: (pred_4 obj_08 obj_09) (pred_2 obj_01 obj_02)
   added: (pred_3 obj_01 obj_08 obj_02)
   goals met: 2 of 3
6. (op_2 obj_01 obj_09 obj_07)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_07)
   goals met: 2 of 3
7. (op_3 obj_01 obj_08 obj_07 obj_02)
   deleted: (pred_3 obj_01 obj_08 obj_02)
   added: (pred_4 obj_08 obj_07) (pred_2 obj_01 obj_02)
   goals met: 3 of 3
